app/controllers/v1/reservations_controller.rb

  def index
    render json: Reservation.all.to_json
---
SELECT "reservations".* FROM "reservations"

  def show
    reservation = Reservation.find_by(id: params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    reservation = Reservation.new(reservation_params)
    reservation.cost = reservation.journeyman.price * reservation.number_days

    if reservation.save
---
INSERT INTO "reservations" ("start_date", "number_days", "cost", "created_at", "updated_at", "user_id", "journeyman_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    reservation = Reservation.find_by(id: params[:id])

    if reservation.nil?
      render status: 404, json: { error: 'Reservation not found' }.to_json
    else
      reservation.destroy
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 5]]